""" 
Напишите программу, которая выводит результат
деления двух вводимых чисел
"""

a = input('Введите делимое число: ')
b = input('Введите делитель: ')
c = int(a) / int(b)
print('Результат: ', c)
